<template>
	<q-layout view="hHh lpR fFf" class="help-layout">
		<app-header />
		<side-menu />
		<q-page-container class="help-container">
			<top-info
				:crumb="{ 
        prev: {
          icon: 'home',
          route: 'main'
        },
        current: {
          label: 'Справочная информация', icon: 'help'
        }
       }"
			/>
			<div class="q-pa-md bg-orange text-white accordion">
				<q-list dark bordered class="rounded-borders bg-primary">
					<q-expansion-item
						icon="dashboard"
						label="Описание приложения"
						default-opened
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Работа с подключением к серверу"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Работа с шаблонами документов"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Отчетные периоды"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Обработка CDR файлов"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Работа с отчетными документами"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Обработка ошибок"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
					<q-expansion-item
						icon="dashboard"
						label="Сторнирование"
						header-class="text-white"
						group="actionsGroup"
						class="accordion__item"
					>
						<q-card class="bg-grey-9">
							<q-card-section>
								<p>
									DGenerator NG - приложение, которое позволяет генерировать и управлять платежными документами
									клиентов фиксированной связи, отчетными и финансовыми документами, а также статистику по
									транкам к присоединяющим операторам связи.
								</p>
								<p>
									Данное приложение работает с базой данных биллинговой системы UTM5, расположенной на удаленном хосте
									в локальной сети предприятия. Соответственно, в случае отсутсвия соединения с сервером, приложение
									не сможет выполнять указанные задачи.
								</p>
								<p>
									Для получения справочной информации воспользуйтесь ссылкой ниже. В случае обнаружения ошибок либо
									предложений для доработки свяжитесь с разработчиком по телефону 104.
								</p>
							</q-card-section>
						</q-card>
					</q-expansion-item>
				</q-list>
			</div>
			<!-- Reconnection dialog -->
			<connection-modal />
			<!-- End reconnection dialog -->
		</q-page-container>
		<app-footer />
	</q-layout>
</template>

<script>
import AppHeader from "../../components/Header.vue";
import SideMenu from "../../components/SideMenu.vue";
import TopInfo from "../../components/ContainerTopInfo.vue";
import AppFooter from "../../components/Footer.vue";
import ConnectionModal from "../../components/ConnectionModal.vue";

export default {
	name: "HelpPage",
	components: {
		AppHeader,
		SideMenu,
		TopInfo,
		AppFooter,
		ConnectionModal
	}
};
</script>

<style lang="scss" scoped>
@import "../../css/app.scss";
.help-layout {
	min-width: 1024px;
	width: 100%;
	height: 100vh;
	background-color: $background;
	overflow-y: auto;
	.accordion {
		.accordion__item {
			button {
				@include coloredButton($primary, $orange, $orange, none, 10px 15px);
			}
			.q-file {
				margin-bottom: 18px;
			}
		}
	}
}
</style>